Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/include/pio/pic32ck0512gc01100.h
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA05D_SERCOM5_PAD0                     _UINT32_(5) 
#define MUX_PA05D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM5_PAD0                  ((PIN_PA05D_SERCOM5_PAD0 << 16) | MUX_PA05D_SERCOM5_PAD0)
#define PORT_PA05D_SERCOM5_PAD0                    (_UINT32_(1) << 5)

#define PIN_PA11C_SERCOM5_PAD0                     _UINT32_(11)
#define MUX_PA11C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA11C_SERCOM5_PAD0                  ((PIN_PA11C_SERCOM5_PAD0 << 16) | MUX_PA11C_SERCOM5_PAD0)
#define PORT_PA11C_SERCOM5_PAD0                    (_UINT32_(1) << 11)

#define PIN_PA13C_SERCOM5_PAD0                     _UINT32_(13)
#define MUX_PA13C_SERCOM5_PAD0                     _UINT32_(2) 
#define PINMUX_PA13C_SERCOM5_PAD0                  ((PIN_PA13C_SERCOM5_PAD0 << 16) | MUX_PA13C_SERCOM5_PAD0)
#define PORT_PA13C_SERCOM5_PAD0                    (_UINT32_(1) << 13)

#define PIN_PA06D_SERCOM5_PAD1                     _UINT32_(6) 
#define MUX_PA06D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM5_PAD1                  ((PIN_PA06D_SERCOM5_PAD1 << 16) | MUX_PA06D_SERCOM5_PAD1)
#define PORT_PA06D_SERCOM5_PAD1                    (_UINT32_(1) << 6)

#define PIN_PA12C_SERCOM5_PAD1                     _UINT32_(12)
#define MUX_PA12C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA12C_SERCOM5_PAD1                  ((PIN_PA12C_SERCOM5_PAD1 << 16) | MUX_PA12C_SERCOM5_PAD1)
#define PORT_PA12C_SERCOM5_PAD1                    (_UINT32_(1) << 12)

#define PIN_PA14C_SERCOM5_PAD1                     _UINT32_(14)
#define MUX_PA14C_SERCOM5_PAD1                     _UINT32_(2) 
#define PINMUX_PA14C_SERCOM5_PAD1                  ((PIN_PA14C_SERCOM5_PAD1 << 16) | MUX_PA14C_SERCOM5_PAD1)
#define PORT_PA14C_SERCOM5_PAD1                    (_UINT32_(1) << 14)

#define PIN_PA07D_SERCOM5_PAD2                     _UINT32_(7) 
#define MUX_PA07D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA07D_SERCOM5_PAD2                  ((PIN_PA07D_SERCOM5_PAD2 << 16) | MUX_PA07D_SERCOM5_PAD2)
#define PORT_PA07D_SERCOM5_PAD2                    (_UINT32_(1) << 7)

#define PIN_PA15C_SERCOM5_PAD2                     _UINT32_(15)
#define MUX_PA15C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PA15C_SERCOM5_PAD2                  ((PIN_PA15C_SERCOM5_PAD2 << 16) | MUX_PA15C_SERCOM5_PAD2)
#define PORT_PA15C_SERCOM5_PAD2                    (_UINT32_(1) << 15)

#define PIN_PB00C_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PB00C_SERCOM5_PAD2                  ((PIN_PB00C_SERCOM5_PAD2 << 16) | MUX_PB00C_SERCOM5_PAD2)
#define PORT_PB00C_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA08D_SERCOM5_PAD3                     _UINT32_(8) 
#define MUX_PA08D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM5_PAD3                  ((PIN_PA08D_SERCOM5_PAD3 << 16) | MUX_PA08D_SERCOM5_PAD3)
#define PORT_PA08D_SERCOM5_PAD3                    (_UINT32_(1) << 8)

#define PIN_PA16C_SERCOM5_PAD3                     _UINT32_(16)
#define MUX_PA16C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PA16C_SERCOM5_PAD3                  ((PIN_PA16C_SERCOM5_PAD3 << 16) | MUX_PA16C_SERCOM5_PAD3)
#define PORT_PA16C_SERCOM5_PAD3                    (_UINT32_(1) << 16)

#define PIN_PB01C_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PB01C_SERCOM5_PAD3                  ((PIN_PB01C_SERCOM5_PAD3 << 16) | MUX_PB01C_SERCOM5_PAD3)
#define PORT_PB01C_SERCOM5_PAD3                    (_UINT32_(1) << 1)

/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PA00D_SERCOM6_PAD0                     _UINT32_(0) 
#define MUX_PA00D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM6_PAD0                  ((PIN_PA00D_SERCOM6_PAD0 << 16) | MUX_PA00D_SERCOM6_PAD0)
#define PORT_PA00D_SERCOM6_PAD0                    (_UINT32_(1) << 0)

#define PIN_PA18D_SERCOM6_PAD0                     _UINT32_(18)
#define MUX_PA18D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PA18D_SERCOM6_PAD0                  ((PIN_PA18D_SERCOM6_PAD0 << 16) | MUX_PA18D_SERCOM6_PAD0)
#define PORT_PA18D_SERCOM6_PAD0                    (_UINT32_(1) << 18)

#define PIN_PA07C_SERCOM6_PAD0                     _UINT32_(7) 
#define MUX_PA07C_SERCOM6_PAD0                     _UINT32_(2) 
#define PINMUX_PA07C_SERCOM6_PAD0                  ((PIN_PA07C_SERCOM6_PAD0 << 16) | MUX_PA07C_SERCOM6_PAD0)
#define PORT_PA07C_SERCOM6_PAD0                    (_UINT32_(1) << 7)

#define PIN_PA01D_SERCOM6_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM6_PAD1                  ((PIN_PA01D_SERCOM6_PAD1 << 16) | MUX_PA01D_SERCOM6_PAD1)
#define PORT_PA01D_SERCOM6_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA08C_SERCOM6_PAD1                     _UINT32_(8) 
#define MUX_PA08C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM6_PAD1                  ((PIN_PA08C_SERCOM6_PAD1 << 16) | MUX_PA08C_SERCOM6_PAD1)
#define PORT_PA08C_SERCOM6_PAD1                    (_UINT32_(1) << 8)

#define PIN_PA02D_SERCOM6_PAD2                     _UINT32_(2) 
#define MUX_PA02D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM6_PAD2                  ((PIN_PA02D_SERCOM6_PAD2 << 16) | MUX_PA02D_SERCOM6_PAD2)
#define PORT_PA02D_SERCOM6_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA19D_SERCOM6_PAD2                     _UINT32_(19)
#define MUX_PA19D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PA19D_SERCOM6_PAD2                  ((PIN_PA19D_SERCOM6_PAD2 << 16) | MUX_PA19D_SERCOM6_PAD2)
#define PORT_PA19D_SERCOM6_PAD2                    (_UINT32_(1) << 19)

#define PIN_PA09C_SERCOM6_PAD2                     _UINT32_(9) 
#define MUX_PA09C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PA09C_SERCOM6_PAD2                  ((PIN_PA09C_SERCOM6_PAD2 << 16) | MUX_PA09C_SERCOM6_PAD2)
#define PORT_PA09C_SERCOM6_PAD2                    (_UINT32_(1) << 9)

#define PIN_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM6_PAD3                  ((PIN_PA03D_SERCOM6_PAD3 << 16) | MUX_PA03D_SERCOM6_PAD3)
#define PORT_PA03D_SERCOM6_PAD3                    (_UINT32_(1) << 3)

